[
    {
        "etymology": "From Middle English gon, goon, from Old English gān (“to go”), from Proto-West Germanic *gān, from Proto-Germanic *gāną (“to go”), from Proto-Indo-European *ǵʰeh₁- (“to leave”).\nThe inherited past tense form yode (compare Old English ēode) was replaced through suppletion in the 15th century by went, from Old English wendan (“to go, depart, wend”).\nCognate with Scots gae (“to go”), West Frisian gean (“to go”), Dutch gaan (“to go”), Low German gahn (“to go”), German gehen (“to go”), Swedish and Danish gå (“to go”), Norwegian gå (“to walk”). Compare also Albanian ngah (“to run, drive, go”), Ancient Greek κιχάνω (kikhánō, “to meet with, arrive at”), Avestan 𐬰𐬀𐬰𐬁𐬨𐬌‎ (zazāmi), Sanskrit जहाति (jáhāti)",
        "definitions": [
            {
                "part_of_speech": "verb",
                "texts": "",
                "related_words": [],
                "example_uses": [
                    "She was so mad she wouldn't speak to me for quite a spell, but at last I coaxed her into going up to Miss Emmeline's room and fetching down a tintype of the missing Deacon man.",
                    "[...] there was a general sense of panic going through the house; [...]",
                    "Telegrams to London went by wire to Halifax, Nova Scotia, thence by steam mail packet to Liverpool, [...]",
                    "I have to go now.Audio ",
                    "Audio ",
                    "Why don’t you go with us?",
                    "This train goes through Cincinnati on its way to Chicago.",
                    "Chris, where are you going?",
                    "There's no public transit where I'm going.",
                    "Wow, look at him go!",
                    "You have to go all the way back to Herbert Hoover to see a performance in the Standard & Poors 500 equal to what we are experiencing right now.",
                    "\"I don't know how to tell you this, Aubrey, but you can't go back to 1938 [...] the program won't accept any date that I input before 1941.\" [...] \"Well, I'll go to 1941, then.\"",
                    "Yesterday was the second-wettest day on record; you have to go all the way back to 1896 to find a day when more rain fell.",
                    "Fans want to see the Twelfth Doctor go to the 51st century to visit River in the library.",
                    "To access Office-related TechNet resources, go to www.microsoft.com/technet/prodtechnol/office.",
                    "Go to your earliest memory and to your favorite one, then to one that's difficult to consider.",
                    "Go to drive C: through My Computer  and double-click the c:\\data folder.",
                    "The car went a short distance, then halted. There was something wrong with the carburetor.",
                    "We've only gone twenty miles today.",
                    "This car can go circles around that one.",
                    "We went swimming.",
                    "Let's go shopping.",
                    "Synonyms: depart, leave, exit, go away, go out",
                    "Antonyms: come, arrive, approach",
                    "Please don't go!",
                    "I really must be going.",
                    "Workmen were coming and going at all hours of the night.",
                    "And following Dee, which Britons long ygone / Did call diuine, that doth by Cheſter tend; [...]",
                    "‘As for that,’ seyde Sir Trystram, ‘I may chose othir to ryde othir to go.’",
                    "Master Piercie our new President, was so sicke hee could neither goe nor stand.",
                    "Other brunts I also look for; but this I have resolved on, to wit, to run when I can, to go when I cannot run, and to creep when I cannot go.",
                    "Synonyms: move, fare, tread, draw, drift, wend, cross",
                    "Antonyms: freeze, halt, remain, stand still, stay, stop",
                    "The engine just won't go anymore.",
                    "'Although the lemon is now black and shrivelled the motor is still going strong. If I can make my small motor run for month after month on a single lemon, just imagine how much \"juice\" there must be in a whole sackful', Mr Ashill said.",
                    "[...] though his publisher swears black and blue that Kelder is still going strong and still remains an intensely private person.",
                    "Synonyms: function, work, operate",
                    "Get ready, get set, go!",
                    "On your marks, get set, go!",
                    "On your marks, set, go!",
                    "Here goes nothing.",
                    "Let's go and hunt.",
                    "Be listening for my voice. Go when you hear my voice say go.",
                    "It’s your turn; go.",
                    "Synonyms: move, make one's move, take one’s turn",
                    "I go to school at the schoolhouse.",
                    "She went to Yale.",
                    "They only go to church on Christmas.",
                    "That went well.",
                    "\"How are things going?\" \"Not bad, thanks.\"",
                    "How goes the night, boy?",
                    "I think, as the world goes, he was a good sort of man enough.",
                    "Whether the cause goes for me or against me, you must pay me the reward.",
                    "I certainly won't mention it to Ben, and will go carefully if he mentions it to me.",
                    "Why'd you have to go and do that?",
                    "Why'd you have to go do that?",
                    "He just went and punched the guy.",
                    "And even if she had believed the story about a John Smith, she might go telling everyone in town about what she'd seen.",
                    "I'm repeating it: I wish that you would go this path up to its end, that you shall find salvation!",
                    "Let's go this way for a while.",
                    "She was going that way anyway, so she offered to show him where it was.",
                    "A shady promenade went the length of the street and the entrance to the hotel was a few steps back in the darkness, away from the glaring sunshine.",
                    "This property goes all the way to the state line.",
                    "I think those figures start from 1932 and go to 1941, inclusive, [...]",
                    "Even though they can give a basic fact such as 4 4, I don't know that this knowledge goes very deep for them.",
                    "Does this road go to Fort Smith?",
                    "“Where does this door go?” Bev asked as she pointed to a door painted a darker green than the powder green color of the carpet. Janet answered. “That door goes to the back yard.”",
                    "You'll go blind.  The milk went bad / went sour.",
                    "I went crazy / went mad.",
                    "After failing as a criminal, he decided to go straight.",
                    "The video clip went viral.",
                    "Don't tell my Mum: she'll go ballistic.",
                    "Referring to the American radicals who went Hollywood in the 1930s, Abraham Polonsky argues that \"you can't possibly explain the Hollywood communists away [...]\"",
                    "Synonyms: become, turn, change into",
                    "There is scarcely a business man who is not occasionally asked to go bail for somebody.",
                    "Most welfare workers are not allowed to go surety for clients.",
                    "I don't want my children to go hungry.",
                    "We went barefoot in the summer.",
                    "They went into debt, she goes to sleep around 10 o'clock.",
                    "the local shop wants to go digital, and eventually go global.",
                    "The traffic light went straight from green to red.",
                    "How did your meeting with Smith go?",
                    "When Wharton had to relinquish his seat in Buckinghamshire on his elevation to the peerage in 1696, he was unable to replace himself with a suitable man, and the by-election went in favour of a local Tory, Lord Cheyne.",
                    "Well, that goes to show you.",
                    "These experiences go to make us stronger.",
                    "qualities that go to make a lady / lip-reader / sharpshooter",
                    "What can we know of any substance or existence, but as made up of all the qualities that go to its composition: extension, solidity, form, colour; take these away, and you know nothing.",
                    "The avoirdupois pound is one of 7,000 grains, and  go to the pound.",
                    "The time went slowly.",
                    "But the days went and went, and she never came; and then I thought I would come here where you were.",
                    "The rest of the morning went quickly and before Su knew it Jean was knocking on the door [...]",
                    "After three days, my headache finally went.",
                    "Synonyms: disappear, vanish, go away, end, dissipate",
                    "Antonyms: remain, stay, hold",
                    "His money went on drink.",
                    "All I have is a sleeping bag right now. All my money goes to keep up the cars.",
                    "By Saint George, he's gone! / That spear wound hath our master sped.",
                    "\"Your father's gone.\" \"Okay, okay, the Gaffer's kicked off. What happened?\"",
                    "I wonder if I hopped up and down, would the bridge go?",
                    "Sober-eyed commentators safe in their television studios interviewed engineers about the chances that the rest of the dam could go.",
                    "Jackson shook his head. \"The contractor said those panes could go at any moment.\" \"Right. Just like the wiring could go at any moment, and the roof could go at any moment.\"",
                    "Synonyms: crumble, collapse, disintegrate, give way",
                    "My mind is going.",
                    "She's 83; her eyesight is starting to go.",
                    "The car went for five thousand dollars.",
                    "The store is closing down so everything must go.",
                    "This chair has got to go.",
                    "All this old rubbish can go.",
                    "The property shall go to my wife.",
                    "The award went to Steven Spielberg.",
                    "If my money goes to education, I want a report card.",
                    "Against the Big Green, Princeton went the entire first and third quarters without gaining a first down, [...]",
                    "England have now gone four games without a win at Wembley, their longest sequence without a victory in 30 years, and still have much work to do to reach Euro 2012 as they prepare for a testing trip to face Bulgaria in Sofia in September.",
                    "'Surely one cannot go for long in this world to-day without at least a thought for St Simon Stylites?'",
                    "How long can you go without water?",
                    "We've gone without your help for a while now.",
                    "I've gone ten days now without a cigarette.",
                    "Can you two go twenty minutes without arguing?!",
                    "They've gone one for three in this series.",
                    "The team is going five in a row.",
                    "Whatever the boss says goes, do you understand?",
                    "[...] every of them, being gold, whole and weight, shall go and be current in payment throughout this his realm for the sum that they were coined for.",
                    "Anything goes around here.",
                    "The man went among men for an old man in the days of Saul.",
                    "The money which remains should go according to its true value.",
                    "[To job interviews, wear] muted colors. No pink or paisley  [...]",
                    "I go, \"As if!\" And she was all like, \"Whatever!\"",
                    "As soon as I did it, I went \"that was stupid.\"",
                    "Cats go \"meow\". Motorcycles go \"vroom\".",
                    "At 4pm, the phone went. It was The Sun: 'We hear your daughter's been expelled for cheating at her school exams...'She'd made a remark to a friend at the end of the German exam and had been pulled up for talking.As they left the exam room, she muttered that the teacher was a 'twat'. He heard and flipped—a pretty stupid thing to do, knowing the kids were tired and tense after exams. Instead of dropping it, the teacher complained to the Head and Deb was carpeted.",
                    "I woke up just before the clock went.",
                    "The tune goes like this.",
                    "As the story goes, he got the idea for the song while sitting in traffic.",
                    "I'll go to court if I have to.",
                    "I'm going to join a sports team.",
                    "I wish you'd go and get a job.",
                    "He went to pick it up, but it rolled out of reach.",
                    "He's going to leave town tomorrow.",
                    "Seeing himself confronted by so many, like a resolute orator, he went not to denial, but to justify his cruel falsehood.",
                    "Now I didn't go to make that mistake about the record-breaking drought of more than fifty years ago, but, boy, am I glad I made it. Otherwise, I wouldn't have heard from Joe Almand.",
                    "You didn't have to go to such trouble.",
                    "I never thought he'd go so far as to call you.",
                    "She went to great expense to help them win.",
                    "I've gone over this a hundred times.",
                    "Let's not go into that right now.",
                    "Do you think the sofa will go through the door?",
                    "The belt just barely went around his waist.",
                    "Synonyms: fit, pass, stretch, come, make it",
                    "This shade of red doesn't go with the drapes.",
                    "White wine goes better with fish than red wine.",
                    "Synonym: harmonize",
                    "Antonym: clash",
                    "My shirts go on this side of the wardrobe.",
                    "This piece of the jigsaw goes on the other side.",
                    "Synonyms: belong, have a place",
                    "How long having they been going together?",
                    "He's been going with her for two weeks.",
                    "Synonyms: go out , date, see",
                    "You wanna go, little man?",
                    "I went at him with a knife.",
                    "You've shown me his weak points, and I'll go him whether you stick by me or not.",
                    "As big as me. Strong, too. I was itching to go him, And he had clouted Ernie.",
                    "Then I′m sure I heard him mutter ‘Why don′t you get fucked,’ under his breath.",
                    "It was at that moment that I became a true professional. Instead of going him, I announced the next song.",
                    "Tom stepped back, considered the hill, and taking off down it. She was going to go him for blowing that flamin′ whistle in her ear all day.",
                    "As sentences go, this one is pretty boring.",
                    "They are fairly rough and ready as models go, not often driven to the rigor of an authentic scientific law, and never worried about coming out with some revolutionary mathematical language — but models nonetheless, [...]",
                    "They were to go equal shares in the booty.",
                    "Let's go halves on this.",
                    "This'll go three tons to the acre, or I'll eat my shirt.",
                    "Those babies go five tons apiece.",
                    "That's as high as I can go.",
                    "We could go two fifty.",
                    "I'll go a ten-spot.",
                    "I'll go you a shilling.",
                    "I'll go him one better.",
                    "I could go a beer right about now.",
                    "I really need to go.",
                    "Have you managed to go today, Mrs. Miggins?",
                    "Clarence was just as surprised to see Richard, and he went—right there in the doorway. I had slept through all this mayhem on the other side of the apartment. By the time I got up, these were all semi-comical memories and the urine had been cleaned up.",
                    "Synonyms: see Thesaurus:urinate, Thesaurus:defecate",
                    "Go girl! You can do it!"
                ]
            },
            {
                "part_of_speech": "noun",
                "texts": "",
                "related_words": [],
                "example_uses": [
                    "The Apostles were to be the first of a line. They would multiply successors, and the successors would die and their successors after them, but the line would never fail; and the come and go of men would not matter, since it is the one Christ operating through all of them.",
                    "They talk easily together and they hear the come and go of the breeze in the soon to be turning burnt leaves of the high trees.",
                    "You’ve been on that pinball machine long enough—now let your brother have a go.",
                    "It’s your go.",
                    "Synonyms: stint,  turn,  move, turn",
                    "I’ll give it a go.",
                    "You have to stay and we will have a go at winning the championship next season.\"",
                    "Synonyms: attempt, bash, shot, stab, try",
                    "We will begin as soon as the boss says it's a go.",
                    "\"Well, Tom, is it a go? You can trust me, for you'll have the thousand in your pocket before you start.[...]\"",
                    "And as soon as we gave them the go to continue, we lost communication.",
                    "Synonym: green light",
                    "Let this suffice, that that same happy night, / So gracious were the goes of marriage [...]",
                    "“Well, this is a pretty go, is this here! An uncommon pretty go!",
                    "“Ain't this a rum go? This is a queer sort of dodge for lighting the streets.”",
                    "\"Supposing now that some of them were to slip into the boat at night and cut the cable, make off with her? That would be a pretty go, that would.\"",
                    "quite the go",
                    "We are blowing each other out of the market with cheapness; but it is all the go, so we must not be behind the age.",
                    "Synonyms: mode, style, trend",
                    "a high go",
                    "When the cloth was removed, Mr. Thomas Potter ordered the waiter to bring in two goes of his best Scotch whiskey, with warm water and sugar, and a couple of his \"very mildest\" Havannas,",
                    "“Then, if you value it so highly,” I said, “you can hardly object to stand half a go of brandy for its recovery.”",
                    "Synonyms: gage, measure",
                    "There is no go in him.",
                    "Synonyms: energy, flair, liveliness, perseverance, pizzazz, spirit, verve, vigour, vim, vitality, zest",
                    "ate it all in one go",
                    "This could mean that the artist traced the illustration in two goes, as it were, or that the Utrecht Psalter slipped while he was tracing, but I do not think that the relative proportions are consistent enough to demonstrate this.",
                    "That TOM, who was the GO among the GOES, in the very centre of fashion in London, should have to encounter the vulgar stare of this village; or, that the dairy-maid should leave off skimming her cream to take a peep at our hero, as he mounted his courser, is not at all surprising: and TOM only smiled at this provincial sort of rudeness.",
                    "He's a go among the goes, is Mr. Kestrel. He's only got to sport a new kind of topper, or tie his crumpler a new way, and every gentry-cove in town does just the same.",
                    "See Thesaurus:dandy"
                ]
            },
            {
                "part_of_speech": "adjective",
                "texts": "",
                "related_words": [],
                "example_uses": [
                    "John Glenn reports all systems are go.",
                    "\"Life support system is go,\" said the earphone.",
                    "“Green One has four starts and is go.”",
                    "“Weapons ready?” Sam and I pull our loaded BB guns  out of the bag and slot them into place in the longholsters on our backs.“ Weapons are go,” Sam replied."
                ]
            }
        ],
        "pronunciations": {
            "text": [
                "(Received Pronunciation) enPR: gō, IPA: /ɡəʊ/",
                "(General American) enPR: gō, IPA: /ɡoʊ/",
                "(General Australian) IPA: /ɡəʉ/",
                "(General New Zealand) IPA: /ɡɐʉ/",
                "Hyphenation: go",
                "Rhymes: -əʊ"
            ],
            "audio": [
                "//upload.wikimedia.org/wikipedia/commons/e/ef/En-uk-to_go.ogg",
                "//upload.wikimedia.org/wikipedia/commons/0/0a/En-us-go.ogg",
                "//upload.wikimedia.org/wikipedia/commons/8/8f/EN-AU_ck1_go.ogg"
            ]
        }
    },
    {
        "etymology": "From the Japanese character 碁 (go), though it is usually called 囲碁 (igo) in Japanese, taken from the Chinese character 圍棋.\n",
        "definitions": [
            {
                "part_of_speech": "noun",
                "texts": "",
                "related_words": [],
                "example_uses": [
                    "Synonyms: weiqi, baduk"
                ]
            }
        ],
        "pronunciations": {
            "text": [],
            "audio": []
        }
    }
]