[
    {
        "etymology": "From Middle English scole, schole (“group of persons, multitude, host, school of fish”), from Middle Dutch scole (“multitude, troop of people, swarm of animals”), from Old Dutch *scola, *skola (“troop, multitude”), from Proto-Germanic *skulō (“crowd”), from Proto-Indo-European *(s)kʷel- (“crowd, people”). Cognate with Middle Low German schōle (“multitude, troop”), Old English scolu (“troop or band of people, host, multitude, school of fish”). Doublet of shoal. Compare Hebrew הַשְׂכָּלָה‎ (“*(s)cɑlɐ–education”), Hebrew אֶשְׁכּוֹל‎ (“*(s)kʷol–cluster”).\n",
        "definitions": [
            {
                "part_of_speech": "noun",
                "texts": "",
                "related_words": [
                    {
                        "relationship_type": "synonyms",
                        "words": [
                            "(fish): shoal"
                        ]
                    }
                ],
                "example_uses": [
                    "The divers encountered a huge school of mackerel."
                ]
            },
            {
                "part_of_speech": "verb",
                "texts": "",
                "related_words": [],
                "example_uses": []
            }
        ],
        "pronunciations": {
            "text": [
                "enPR: sko͞ol, IPA: /skuːl/",
                "Rhymes: -uːl"
            ],
            "audio": [
                "//upload.wikimedia.org/wikipedia/commons/d/d4/En-uk-school.ogg"
            ]
        }
    },
    {
        "etymology": "From Middle English scole, from Old English scōl (“place of education”), from Proto-Germanic *skōla (“school”), from Late Latin schola, scola (“learned discussion or dissertation, lecture, school”), from Ancient Greek σχολεῖον (skholeîon), from σχολή (skholḗ, “spare time, leisure; conversations and the knowledge gained through them during free time; the places where these conversations took place”), from Proto-Indo-European *seǵʰ- (“to hold, have, possess”). Doublet of schola and shul. Compare Old Frisian skūle, schūle (“school”) (West Frisian skoalle, Saterland Frisian Skoule), Dutch school (“school”), German Low German School (“school”), Old High German scuola (“school”), Old Norse skóli (“school”).\nInfluenced in some senses by Middle English schole (“group of persons, host, company”), from Middle Dutch scole (“multitude, troop, band”). See school1. Related also to Old High German sigi (German Sieg, “victory”), Old English siġe, sigor (“victory”).\n",
        "definitions": [
            {
                "part_of_speech": "noun",
                "texts": "",
                "related_words": [
                    {
                        "relationship_type": "synonyms",
                        "words": [
                            "(institution dedicated to teaching and learning): academy, college, university",
                            "(organizational unity within an educational institution): college, department, faculty, institute"
                        ]
                    },
                    {
                        "relationship_type": "hyponyms",
                        "words": [
                            "See also Thesaurus:school"
                        ]
                    },
                    {
                        "relationship_type": "coordinate terms",
                        "words": [
                            "(institution providing primary and secondary education): nursery school, kindergarten, college, polytechnic, university"
                        ]
                    }
                ],
                "example_uses": [
                    "Our children attend a public school in our neighborhood.",
                    "Harvard University is a famous American postsecondary school.",
                    "One particularly damaging, but often ignored, effect of conflict on education is the proliferation of attacks on schools […] as children, teachers or school buildings become the targets of attacks. Parents fear sending their children to school. Girls are particularly vulnerable to sexual violence.",
                    "Divinity, history and geography are studied for two schools per week.",
                    "We are enrolled in the same university, but I attend the School of Economics and my brother is in the School of Music.",
                    "The Barbizon school of painters were part of an art movement towards Realism in art, which arose in the context of the dominant Romantic Movement of the time.",
                    "Here the stripped panelling was warmly gold and the pictures, mostly of the English school, were mellow and gentle in the afternoon light.",
                    "These economists belong to the monetarist school.",
                    "Let no man be less confident in his faith  […]  by reason of any difference of judgment , which is in the several schools of Christians.",
                    "I'll see you after school.",
                    "He was a gentleman of the old school.",
                    "His face pale but striking, though not handsome after the schools."
                ]
            },
            {
                "part_of_speech": "verb",
                "texts": "",
                "related_words": [],
                "example_uses": [
                    "Many future prime ministers were schooled in Eton.",
                    "A blind law graduate who put the National Conference of Bar Examiners to the test got schooled in federal court.",
                    "Two weeks later, the Cornhuskers put on their road whites again and promptly got schooled by miserable Iowa State in Ames. After the shocking loss  […]",
                    "\"You again?\" Sandman demanded. \"I guess you didn't learn your lesson.\"",
                    "\"This time I'm gonna school you.\"",
                    "She took care to school her expression, not giving away any of her feelings."
                ]
            }
        ],
        "pronunciations": {
            "text": [
                "enPR: sko͞ol, IPA: /skuːl/",
                "Rhymes: -uːl"
            ],
            "audio": [
                "//upload.wikimedia.org/wikipedia/commons/d/d4/En-uk-school.ogg"
            ]
        }
    }
]