[
    {
        "etymology": "From Middle English trien (“to try a legal case”), from Anglo-Norman trier (“to try a case”), Old French trier (“to choose, pick out or separate from others, sift, cull”), of uncertain origin. Believed to be a metathetic variation of Old French tirer (“to pull out, snatch”), from Gothic 𐍄𐌹𐍂𐌰𐌽 (tiran, “to tear away, remove”), from Proto-Germanic *teraną (“to tear, tear apart”), from Proto-Indo-European *der- (“to tear, tear apart”), see tear. Related to Occitan triar (“to pick out, choose from among others”). Alternatively or by confluence, the Old French is from Gallo-Roman Vulgar Latin *triare, of unknown origin.\nReplaced native Middle English cunnen (“to try”) (from Old English cunnian), Middle English fandien (“to try, prove”) (from Old English fandian), and Middle English costnien (“to try, tempt, test”) (from Old English costnian).\n",
        "definitions": [
            {
                "part_of_speech": "verb",
                "texts": "",
                "related_words": [
                    {
                        "relationship_type": "synonyms",
                        "words": [
                            "(to attempt): attempt, endeavor, fand, mint, take a run at, take a stab at",
                            "(to taste, sample, etc): sample, taste"
                        ]
                    },
                    {
                        "relationship_type": "related terms",
                        "words": [
                            "trial",
                            "tried and tested",
                            "tried and true",
                            "trier"
                        ]
                    }
                ],
                "example_uses": [
                    "I tried to rollerblade, but I couldn’t.",
                    "I'll come to dinner soon. I'm trying to beat this level first.",
                    "Not unnaturally, “Auntie” took this communication in bad part. Thus outraged, she showed herself to be a bold as well as a furious virago. Next day she found her way to their lodgings and tried to recover her ward by the hair of the head.",
                    "[Isaac Newton] was obsessed with alchemy. He spent hours copying alchemical recipes and trying to replicate them in his laboratory. He believed that the Bible contained numerological codes.",
                    "[…] euery feend his buſie paines applyde, / To melt the golden metall, ready to be tryde.",
                    "to try out the wild corn from the good",
                    "the wylde corne, beinge in shap and greatnesse lyke to the good, if they be mengled, with great difficultie will be tried out",
                    "I tried mixing more white paint to get a lighter shade.",
                    "I shall try my skills on this.",
                    "The Celebrity, by arts unknown, induced Mrs. Judge Short and two other ladies to call at Mohair on a certain afternoon when Mr. Cooke was trying a trotter on the track. The three returned wondering and charmed with Mrs. Cooke; they were sure she had had no hand in the furnishing of that atrocious house.",
                    "“So mousie shall only find tins on the floor now,” thought Miss Mapp. “Mousie shall try his teeth on tins.”",
                    "Plant breeding is always a numbers game. […] The wild species we use are rich in genetic variation, and individual plants are highly heterozygous and do not breed true. In addition, we are looking for rare alleles, so the more plants we try, the better.",
                    "You are trying my patience.",
                    "Don't fucking try me.",
                    "Mona: Try this vampire bolt on for size!",
                    "Cedric: Why don't you try this alien bolt?",
                    "Try this—you’ll love it.",
                    "to try weights or measures by a standard;  to try a person's opinions",
                    "Let the end try the man.",
                    "I'll try whether I can make it across town on foot.",
                    "Sir, the doctors and apothecaries are the greatest thieves in the world; they are always trying which can rob their patients the most.",
                    "He was tried and executed.",
                    "The murderer, he recalled, had been tried and sentenced to imprisonment for life, but was pardoned by a merciful governor after serving a year of his sentence.",
                    "I sit in front of the mirror and try myself. I am no impartial judge, otherwise I would have had myself executed several times over by now.",
                    "Sansa pretends to gather everyone in the great hall to try Arya, and at the last moment reveals she’s actually trying Littlefinger for murder and treason, although I think everyone in that room already knew what was going on except him.",
                    "[…] try the Lybian Heat, or Scythian Cold.",
                    "You are trying too hard.",
                    "How do you try! ",
                    "to try rival claims by a duel;  to try conclusions",
                    "[…] Left I the Court, to ſee this Quarrell try’de.",
                    "The light tries his eyes.",
                    "Repeated failures try one's patience.",
                    "I am really not trying to hear you talk about my mama like that."
                ]
            },
            {
                "part_of_speech": "noun",
                "texts": "",
                "related_words": [
                    {
                        "relationship_type": "synonyms",
                        "words": [
                            "(an attempt): bash, go, stab, whirl",
                            "(an act of tasting or sampling): sampling, taste, tasting",
                            "(a score in rugby): touchdown (American football)",
                            "(the point after touchdown): extra point (American football)"
                        ]
                    }
                ],
                "example_uses": [
                    "I gave unicycling a try but I couldn’t do it.",
                    "There was the day also when his favourite right uppercut had connected in most accurate and rhythmical fashion with the protruded chin of Bull Wardell of Whitechapel, whereby Silas put himself in the way of a Lonsdale Belt and a try for the championship.",
                    "I gave sushi a try but I didn’t like it.",
                    "Today I scored my first try.",
                    "But two penalties and a drop-goal from Jonny Wilkinson, despite a host of other wayward attempts, plus a late try from Chris Ashton were enough to send a misfiring England through."
                ]
            }
        ],
        "pronunciations": {
            "text": [
                "enPR: trī, IPA: /tɹaɪ/",
                "Rhymes: -aɪ"
            ],
            "audio": [
                "//upload.wikimedia.org/wikipedia/commons/0/09/En-us-try.ogg",
                "//upload.wikimedia.org/wikipedia/commons/3/3c/En-uk-to_try.ogg"
            ]
        }
    },
    {
        "etymology": "Probably from Old French trié.\n",
        "definitions": [
            {
                "part_of_speech": "adjective",
                "texts": "",
                "related_words": [],
                "example_uses": [
                    "But he her ſuppliant hands, thoſe hands of gold, / And eke her feete, thoſe feete of ſiluer trye, […] Chopt off […]."
                ]
            }
        ],
        "pronunciations": {
            "text": [
                "enPR: trī, IPA: /tɹaɪ/",
                "Rhymes: -aɪ"
            ],
            "audio": [
                "//upload.wikimedia.org/wikipedia/commons/0/09/En-us-try.ogg",
                "//upload.wikimedia.org/wikipedia/commons/3/3c/En-uk-to_try.ogg"
            ]
        }
    }
]