[
    {
        "etymology": "From Middle English somthing, some-thing, som thing, sum thinge, sum þinge, from Old English sum þing (literally “some thing”), equivalent to some +‎ thing. Compare Old English āwiht (“something”, literally “some thing, any thing”), Swedish någonting (“something”, literally “some thing, any thing”).\n",
        "definitions": [
            {
                "part_of_speech": "pronoun",
                "texts": "",
                "related_words": [
                    {
                        "relationship_type": "related terms",
                        "words": [
                            "-something",
                            "-somethingth",
                            "thing",
                            "nothing",
                            "anything",
                            "everything",
                            "somebody",
                            "someone",
                            "somewhere"
                        ]
                    }
                ],
                "example_uses": [
                    "Synonym:  sth",
                    "I must have forgotten to pack something, but I can't think what.",
                    "I have something for you in my bag.",
                    "I have a feeling something good is going to happen today.",
                    "The answer to four down is P something T something Y.",
                    "She looked thirty-something. ",
                    "Seeing the British establishment struggle with the financial sector is like watching an alcoholic who still resists the idea that something drastic needs to happen for him to turn his life around.",
                    "The performance was something of a disappointment.",
                    "That child is something of a genius.",
                    "Then came a maid with hand-bag and shawls, and after her a tall young lady. She stood for a moment holding her skirt above the grimy steps, with something of the stately pose which Richter has given his Queen Louise on the stairway, and the light of the reflector fell full upon her.",
                    "Christensen, who also edited and co-wrote the film, is becoming something of a specialist in child horror, having launched his feature directorial career with the infant-themed Still/Born in 2017.",
                    "Synonym: je ne sais quoi",
                    "She has a certain something.",
                    "He's really something! I've never heard such a great voice.",
                    "She's quite something. I can't believe she would do such a mean thing.",
                    "Some marmosets are less than six inches tall. —Well, isn't that something?"
                ]
            },
            {
                "part_of_speech": "adjective",
                "texts": "",
                "related_words": [],
                "example_uses": [
                    "\"Very poetic.\" They came to a halt before the outer door. \"It's very something,\" Rusty said wistfully. \"How do you do it?\"",
                    "\"It's very — it's very something,\" said Lucy. \"It's a kind of love-letter, isn't it?\"",
                    "If it isn't large, I certainly can't say it's small. But it's very something.",
                    "'How proud they have become,' I said, 'how disobedient. I must say, all in all, it's very something.'"
                ]
            },
            {
                "part_of_speech": "adverb",
                "texts": "",
                "related_words": [],
                "example_uses": [
                    "The baby looks something like his father.",
                    "I miss them something terrible. ",
                    "You can't thrash when you have rheumatic fever – though you want to something awful, Mrs. White says.",
                    "Seeing him here, though, I all of a sudden feel more like I been gone from home three years, instead of three weeks, and I miss my people something fierce.",
                    "And then she put the coffin right out on her front porch. Jim told everyone he'd built it kind of roomy since Bobby Lee was on the stout side, but that it better get used quick because sycamore tends to warp something terrible."
                ]
            },
            {
                "part_of_speech": "verb",
                "texts": "",
                "related_words": [],
                "example_uses": [
                    "He didn’t apply for it for a long time, and then there was a hitch about it, and it was somethinged—vetoed, I believe she said.",
                    "She hovers over the something somethinging and awkwardly lowers her bulk.",
                    "“Oh how we somethinged on the hmmm hmm we were wed. Dear, was I ever on the stage?”"
                ]
            },
            {
                "part_of_speech": "noun",
                "texts": "",
                "related_words": [],
                "example_uses": [
                    "From the ground, Colombo’s port does not look like much. […]   But viewed from high up in one of the growing number of skyscrapers in Sri Lanka’s capital, it is clear that something extraordinary is happening: China is creating a shipping hub just 200 miles from India’s southern tip.",
                    "What was the something the pilot saw, the something worth killing for?",
                    "Moreover, in all of our experience with these sense impressions, we never lose sight of the fact that they are but incidental facts of our mental existence, and that there is a Something Within which is really the Subject of these sense reports—a Something to which these reports are presented, and which receives them.",
                    "She wiped something with a cloth, wiped at the wall shelf, and put the something on it, clinking glass."
                ]
            }
        ],
        "pronunciations": {
            "text": [
                "(UK) IPA: /ˈsʌmθɪŋ/, [ˈsɐmθɪŋ]",
                "(US) IPA: /ˈsʌmθɪŋ/, [ˈsʌn̪θɪŋ], (sometimes reduced to [ˈsʌ(m)ʔm̩] or [ˈsʌɾ̃ɪŋ], or even monosyllabically to [sʌ̃ː] or [sʌɪŋ])",
                "(General Australian) IPA: /ˈsamθɪŋ/, [ˈsämθɪŋ]",
                "Hyphenation: some‧thing"
            ],
            "audio": [
                "//upload.wikimedia.org/wikipedia/commons/1/13/En-us-something.ogg"
            ]
        }
    }
]